---
kind: type
id: T:Autodesk.Revit.UI.SketchGalleryOptions
source: html/3df59ea1-731b-ebb5-a602-aa0f56899344.htm
---
# Autodesk.Revit.UI.SketchGalleryOptions

Enumerates all the sketch options.

## Syntax (C#)
```csharp
public enum SketchGalleryOptions
```